Revit 2027 API
FileExportingEventArgs Properties
The FileExportingEventArgs type exposes the following members.
Properties
Name | Description
BackgroundOperation |  Identifies whether the event belongs to a background export operation.
Cancellable |  Indicates whether an event may be cancelled by an event delegate.
(Inherited from RevitAPIEventArgs)
Document |  The document associated with the event.
(Inherited from RevitAPIPreDocEventArgs)
Format |  Identifies the export format, e.g. DWG or image.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
(Inherited from RevitAPIEventArgs)
Path |  The target path for the export.
Top
See Also
Reference
FileExportingEventArgs Class
Autodesk.Revit.DB.Events Namespace